# GetDocDrpShadowData

## Description
```pascal
PROCEDURE GetDocDrpShadowData(
				VAR bUseDropShadow : BOOLEAN;
				VAR nUnits         : INTEGER;
				VAR dOffset        : REAL;
				VAR dBlurRadius    : REAL;
				VAR dAngle         : REAL;
				VAR nOpacity       : INTEGER;
				VAR colorRV        : INTEGER;
				VAR colorGV        : INTEGER;
				VAR colorBV        : INTEGER);
```

```python

def vs.GetDocDrpShadowData():
    return (bUseDropShadow, nUnits, dOffset, dBlurRadius, dAngle, nOpacity, colorRV, colorGV, colorBV)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|bUseDropShadow|BOOLEAN||
|nUnits|INTEGER||
|dOffset|REAL||
|dBlurRadius|REAL||
|dAngle|REAL||
|nOpacity|INTEGER||
|colorRV|INTEGER||
|colorGV|INTEGER||
|colorBV|INTEGER||

## Version
Availability: from Vectorworks 2017
## Category
* Document Attributes